SunCity/src/InformationRegisters/РаспределениеНоменклатуры/РаспределениеНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РаспределениеНоменклатуры</name>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>СкладПродажи</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </resources>
  <resources>
    <name>СкладПоступления</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </resources>
  <dimensions>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТоварнаяГруппа</name>
    <type>
      <types>CatalogRef.ТоварныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SunCity/src/Catalogs/Склады/Склады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Склады</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ТипСклада</name>
    <type>
      <types>EnumRef.ТипыСкладов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Пользователи</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SunCity/src/InformationRegisters/РаспределениеНоменклатуры/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Запись, Параметры);
	
	Элементы.ТоварнаяГруппа.Доступность = НЕ ЗначениеЗаполнено(Запись.ТоварнаяГруппа);
	Элементы.Магазин.Доступность 		= НЕ ЗначениеЗаполнено(Запись.Магазин);
	
	ИспользуетсяНесколькоСкладов 		= Справочники.Склады.ИспользуетсяНесколькоСкладов(Запись.Магазин);
	ИспользоватьНесколькоОрганизаций 	= ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций");
	
	Элементы.СкладПродажи.Видимость 	= ИспользуетсяНесколькоСкладов;
	Элементы.СкладПоступления.Видимость = ИспользуетсяНесколькоСкладов;
	Элементы.Организация.Доступность	= ИспользоватьНесколькоОрганизаций;
	
	Если НЕ ИспользоватьНесколькоОрганизаций Тогда
		Запись.Организация = ПолучитьОрганизацию();
	КонецЕсли;
	
	Если Параметры.Свойство("СкрытьРабочееМесто") Тогда
		
		Элементы.РабочееМесто.Видимость = Ложь;
		
		Если Параметры.Свойство("РазныеСкладыПродажиПоступления", РазныеСкладыПродажиПоступления) Тогда
			Если НЕ РазныеСкладыПродажиПоступления Тогда
				Элементы.СкладПоступления.Видимость = Ложь;
				Элементы.СкладПродажи.Заголовок		= "Склад";
			КонецЕсли;
		Иначе
			РазныеСкладыПродажиПоступления = Истина; 
		КонецЕсли;
		
	Иначе //Для записи с указанным Рабочим местом нет необходимости вводить Склад поступления
		
		РазныеСкладыПродажиПоступления 		= Ложь;
		Элементы.СкладПоступления.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СкладПродажиПриИзменении(Элемент)
	
	Если НЕ РазныеСкладыПродажиПоступления Тогда
		Запись.СкладПоступления = Запись.СкладПродажи;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МагазинПриИзменении(Элемент)
	
	ИспользуетсяНесколькоСкладов = ИспользуетсяНесколькоСкладов(Запись.Магазин);
	
	ОбщегоНазначенияРТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
		"СкладПродажи", 
		"Видимость", 
		ИспользуетсяНесколькоСкладов);
		
	ОбщегоНазначенияРТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
		"СкладПоступления", 
		"Видимость", 
		ИспользуетсяНесколькоСкладов);
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("РаспределениеНоменклатурыИзменениеЗаписи", Запись.Магазин);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ИспользуетсяНесколькоСкладов(Магазин)

	Возврат Справочники.Склады.ИспользуетсяНесколькоСкладов(Магазин);

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОрганизацию()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Организации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Ссылка;
		
	КонецЕсли;
	
КонецФункции // ПолучитьОрганизацию()


#КонецОбласти
